Wing/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wing
    {
        type            wall;
        nFaces          241;
        startFace       7943;
    }
    wing_te
    {
        type            wall;
        nFaces          11;
        startFace       8184;
    }
    inout
    {
        type            patch;
        nFaces          252;
        startFace       8195;
    }
    sym
    {
        type            symmetry;
        nFaces          242;
        startFace       8447;
    }
)

// ************************************************************************* //
